<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ed947d1b1f72776a15dc92276314c825d77073ac11baa6984d11f9e4480debce","plan_job_ref":"Job Plan Airflow DAGs #493 at https://github.com/cal-itp/data-infra/actions/runs/17106369675","plan_out_hash":"ec9048a2af6aa55983a0acd4aaef68a069eb9a4e82a95e4909035dbedbc108ef","plan_hash":"ca4e80d4057a4add85072fc3d39380532a70eddd738b596a198063d249b65eee","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "aeKgAA==" -> (known after apply)
!~      detect_md5hash      = "vFfVIvQMq+ESrqU6gS4ftQ==" -> "different hash"
!~      generation          = 1749661090706886 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
!~      md5hash             = "vFfVIvQMq+ESrqU6gS4ftQ==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ywRuIQ==" -> (known after apply)
!~      detect_md5hash      = "5cIZgRn7xQWZrtF6cTUFIQ==" -> "different hash"
!~      generation          = 1755275090821996 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "5cIZgRn7xQWZrtF6cTUFIQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "F/xmNg==" -> (known after apply)
!~      detect_md5hash      = "ZSqx6z78ExlzwiEB+Rzk1w==" -> "different hash"
!~      generation          = 1755275092539714 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "ZSqx6z78ExlzwiEB+Rzk1w==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #493](https://github.com/cal-itp/data-infra/actions/runs/17106369675)